Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz2064dag169.h
  .extern C1FIFOINT31INV   /* 0xBF880B2C */
  .extern C1FIFOUA31       /* 0xBF880B30 */
  .extern C1FIFOUA31CLR    /* 0xBF880B34 */
  .extern C1FIFOUA31SET    /* 0xBF880B38 */
  .extern C1FIFOUA31INV    /* 0xBF880B3C */
  .extern C1FIFOCI31       /* 0xBF880B40 */
  .extern C1FIFOCI31CLR    /* 0xBF880B44 */
  .extern C1FIFOCI31SET    /* 0xBF880B48 */
  .extern C1FIFOCI31INV    /* 0xBF880B4C */
  .extern C2CON            /* 0xBF881000 */
  .extern C2CONCLR         /* 0xBF881004 */
  .extern C2CONSET         /* 0xBF881008 */
  .extern C2CONINV         /* 0xBF88100C */
  .extern C2CFG            /* 0xBF881010 */
  .extern C2CFGCLR         /* 0xBF881014 */
  .extern C2CFGSET         /* 0xBF881018 */
  .extern C2CFGINV         /* 0xBF88101C */
  .extern C2INT            /* 0xBF881020 */
  .extern C2INTCLR         /* 0xBF881024 */
  .extern C2INTSET         /* 0xBF881028 */
  .extern C2INTINV         /* 0xBF88102C */
  .extern C2VEC            /* 0xBF881030 */
  .extern C2VECCLR         /* 0xBF881034 */
  .extern C2VECSET         /* 0xBF881038 */
  .extern C2VECINV         /* 0xBF88103C */
  .extern C2TREC           /* 0xBF881040 */
  .extern C2TRECCLR        /* 0xBF881044 */
  .extern C2TRECSET        /* 0xBF881048 */
  .extern C2TRECINV        /* 0xBF88104C */
  .extern C2FSTAT          /* 0xBF881050 */
  .extern C2FSTATCLR       /* 0xBF881054 */
  .extern C2FSTATSET       /* 0xBF881058 */
  .extern C2FSTATINV       /* 0xBF88105C */
  .extern C2RXOVF          /* 0xBF881060 */
  .extern C2RXOVFCLR       /* 0xBF881064 */
  .extern C2RXOVFSET       /* 0xBF881068 */
  .extern C2RXOVFINV       /* 0xBF88106C */
  .extern C2TMR            /* 0xBF881070 */
  .extern C2TMRCLR         /* 0xBF881074 */
  .extern C2TMRSET         /* 0xBF881078 */
  .extern C2TMRINV         /* 0xBF88107C */
  .extern C2RXM0           /* 0xBF881080 */
  .extern C2RXM0CLR        /* 0xBF881084 */
  .extern C2RXM0SET        /* 0xBF881088 */
  .extern C2RXM0INV        /* 0xBF88108C */
  .extern C2RXM1           /* 0xBF881090 */
  .extern C2RXM1CLR        /* 0xBF881094 */
  .extern C2RXM1SET        /* 0xBF881098 */
  .extern C2RXM1INV        /* 0xBF88109C */
  .extern C2RXM2           /* 0xBF8810A0 */
  .extern C2RXM2CLR        /* 0xBF8810A4 */
  .extern C2RXM2SET        /* 0xBF8810A8 */
  .extern C2RXM2INV        /* 0xBF8810AC */
  .extern C2RXM3           /* 0xBF8810B0 */
  .extern C2RXM3CLR        /* 0xBF8810B4 */
  .extern C2RXM3SET        /* 0xBF8810B8 */
  .extern C2RXM3INV        /* 0xBF8810BC */
  .extern C2FLTCON0        /* 0xBF8810C0 */
  .extern C2FLTCON0CLR     /* 0xBF8810C4 */
  .extern C2FLTCON0SET     /* 0xBF8810C8 */
  .extern C2FLTCON0INV     /* 0xBF8810CC */
  .extern C2FLTCON1        /* 0xBF8810D0 */
  .extern C2FLTCON1CLR     /* 0xBF8810D4 */
  .extern C2FLTCON1SET     /* 0xBF8810D8 */
  .extern C2FLTCON1INV     /* 0xBF8810DC */
  .extern C2FLTCON2        /* 0xBF8810E0 */
  .extern C2FLTCON2CLR     /* 0xBF8810E4 */
  .extern C2FLTCON2SET     /* 0xBF8810E8 */
  .extern C2FLTCON2INV     /* 0xBF8810EC */
  .extern C2FLTCON3        /* 0xBF8810F0 */
  .extern C2FLTCON3CLR     /* 0xBF8810F4 */
  .extern C2FLTCON3SET     /* 0xBF8810F8 */
  .extern C2FLTCON3INV     /* 0xBF8810FC */
  .extern C2FLTCON4        /* 0xBF881100 */
  .extern C2FLTCON4CLR     /* 0xBF881104 */
  .extern C2FLTCON4SET     /* 0xBF881108 */
  .extern C2FLTCON4INV     /* 0xBF88110C */
  .extern C2FLTCON5        /* 0xBF881110 */
  .extern C2FLTCON5CLR     /* 0xBF881114 */
  .extern C2FLTCON5SET     /* 0xBF881118 */
  .extern C2FLTCON5INV     /* 0xBF88111C */
  .extern C2FLTCON6        /* 0xBF881120 */
  .extern C2FLTCON6CLR     /* 0xBF881124 */
  .extern C2FLTCON6SET     /* 0xBF881128 */
  .extern C2FLTCON6INV     /* 0xBF88112C */
  .extern C2FLTCON7        /* 0xBF881130 */
  .extern C2FLTCON7CLR     /* 0xBF881134 */
  .extern C2FLTCON7SET     /* 0xBF881138 */
  .extern C2FLTCON7INV     /* 0xBF88113C */
  .extern C2RXF0           /* 0xBF881140 */
  .extern C2RXF0CLR        /* 0xBF881144 */
  .extern C2RXF0SET        /* 0xBF881148 */
  .extern C2RXF0INV        /* 0xBF88114C */
  .extern C2RXF1           /* 0xBF881150 */
  .extern C2RXF1CLR        /* 0xBF881154 */
  .extern C2RXF1SET        /* 0xBF881158 */
  .extern C2RXF1INV        /* 0xBF88115C */
  .extern C2RXF2           /* 0xBF881160 */
  .extern C2RXF2CLR        /* 0xBF881164 */
  .extern C2RXF2SET        /* 0xBF881168 */
  .extern C2RXF2INV        /* 0xBF88116C */
  .extern C2RXF3           /* 0xBF881170 */
  .extern C2RXF3CLR        /* 0xBF881174 */
  .extern C2RXF3SET        /* 0xBF881178 */
  .extern C2RXF3INV        /* 0xBF88117C */
  .extern C2RXF4           /* 0xBF881180 */
  .extern C2RXF4CLR        /* 0xBF881184 */
  .extern C2RXF4SET        /* 0xBF881188 */
  .extern C2RXF4INV        /* 0xBF88118C */
  .extern C2RXF5           /* 0xBF881190 */
  .extern C2RXF5CLR        /* 0xBF881194 */
  .extern C2RXF5SET        /* 0xBF881198 */
  .extern C2RXF5INV        /* 0xBF88119C */
  .extern C2RXF6           /* 0xBF8811A0 */
  .extern C2RXF6CLR        /* 0xBF8811A4 */
  .extern C2RXF6SET        /* 0xBF8811A8 */
  .extern C2RXF6INV        /* 0xBF8811AC */
  .extern C2RXF7           /* 0xBF8811B0 */
  .extern C2RXF7CLR        /* 0xBF8811B4 */
  .extern C2RXF7SET        /* 0xBF8811B8 */
  .extern C2RXF7INV        /* 0xBF8811BC */
  .extern C2RXF8           /* 0xBF8811C0 */
  .extern C2RXF8CLR        /* 0xBF8811C4 */
  .extern C2RXF8SET        /* 0xBF8811C8 */
  .extern C2RXF8INV        /* 0xBF8811CC */
  .extern C2RXF9           /* 0xBF8811D0 */
  .extern C2RXF9CLR        /* 0xBF8811D4 */
  .extern C2RXF9SET        /* 0xBF8811D8 */
  .extern C2RXF9INV        /* 0xBF8811DC */
  .extern C2RXF10          /* 0xBF8811E0 */
  .extern C2RXF10CLR       /* 0xBF8811E4 */
  .extern C2RXF10SET       /* 0xBF8811E8 */
  .extern C2RXF10INV       /* 0xBF8811EC */
  .extern C2RXF11          /* 0xBF8811F0 */
  .extern C2RXF11CLR       /* 0xBF8811F4 */
  .extern C2RXF11SET       /* 0xBF8811F8 */
  .extern C2RXF11INV       /* 0xBF8811FC */
  .extern C2RXF12          /* 0xBF881200 */
  .extern C2RXF12CLR       /* 0xBF881204 */
  .extern C2RXF12SET       /* 0xBF881208 */
  .extern C2RXF12INV       /* 0xBF88120C */
  .extern C2RXF13          /* 0xBF881210 */
  .extern C2RXF13CLR       /* 0xBF881214 */
  .extern C2RXF13SET       /* 0xBF881218 */
  .extern C2RXF13INV       /* 0xBF88121C */
  .extern C2RXF14          /* 0xBF881220 */
  .extern C2RXF14CLR       /* 0xBF881224 */
  .extern C2RXF14SET       /* 0xBF881228 */
  .extern C2RXF14INV       /* 0xBF88122C */
  .extern C2RXF15          /* 0xBF881230 */
  .extern C2RXF15CLR       /* 0xBF881234 */
  .extern C2RXF15SET       /* 0xBF881238 */
  .extern C2RXF15INV       /* 0xBF88123C */
  .extern C2RXF16          /* 0xBF881240 */
  .extern C2RXF16CLR       /* 0xBF881244 */
  .extern C2RXF16SET       /* 0xBF881248 */
  .extern C2RXF16INV       /* 0xBF88124C */
  .extern C2RXF17          /* 0xBF881250 */
  .extern C2RXF17CLR       /* 0xBF881254 */
  .extern C2RXF17SET       /* 0xBF881258 */
  .extern C2RXF17INV       /* 0xBF88125C */
  .extern C2RXF18          /* 0xBF881260 */
  .extern C2RXF18CLR       /* 0xBF881264 */
  .extern C2RXF18SET       /* 0xBF881268 */
  .extern C2RXF18INV       /* 0xBF88126C */
  .extern C2RXF19          /* 0xBF881270 */
  .extern C2RXF19CLR       /* 0xBF881274 */
  .extern C2RXF19SET       /* 0xBF881278 */
  .extern C2RXF19INV       /* 0xBF88127C */
  .extern C2RXF20          /* 0xBF881280 */
  .extern C2RXF20CLR       /* 0xBF881284 */
  .extern C2RXF20SET       /* 0xBF881288 */
  .extern C2RXF20INV       /* 0xBF88128C */
  .extern C2RXF21          /* 0xBF881290 */
  .extern C2RXF21CLR       /* 0xBF881294 */
  .extern C2RXF21SET       /* 0xBF881298 */
  .extern C2RXF21INV       /* 0xBF88129C */
  .extern C2RXF22          /* 0xBF8812A0 */
  .extern C2RXF22CLR       /* 0xBF8812A4 */
  .extern C2RXF22SET       /* 0xBF8812A8 */
  .extern C2RXF22INV       /* 0xBF8812AC */
  .extern C2RXF23          /* 0xBF8812B0 */
  .extern C2RXF23CLR       /* 0xBF8812B4 */
  .extern C2RXF23SET       /* 0xBF8812B8 */
  .extern C2RXF23INV       /* 0xBF8812BC */
  .extern C2RXF24          /* 0xBF8812C0 */
  .extern C2RXF24CLR       /* 0xBF8812C4 */
  .extern C2RXF24SET       /* 0xBF8812C8 */
  .extern C2RXF24INV       /* 0xBF8812CC */
  .extern C2RXF25          /* 0xBF8812D0 */
  .extern C2RXF25CLR       /* 0xBF8812D4 */
  .extern C2RXF25SET       /* 0xBF8812D8 */
  .extern C2RXF25INV       /* 0xBF8812DC */
  .extern C2RXF26          /* 0xBF8812E0 */
  .extern C2RXF26CLR       /* 0xBF8812E4 */
  .extern C2RXF26SET       /* 0xBF8812E8 */
  .extern C2RXF26INV       /* 0xBF8812EC */
  .extern C2RXF27          /* 0xBF8812F0 */
  .extern C2RXF27CLR       /* 0xBF8812F4 */
  .extern C2RXF27SET       /* 0xBF8812F8 */
  .extern C2RXF27INV       /* 0xBF8812FC */
  .extern C2RXF28          /* 0xBF881300 */
  .extern C2RXF28CLR       /* 0xBF881304 */
  .extern C2RXF28SET       /* 0xBF881308 */
  .extern C2RXF28INV       /* 0xBF88130C */
  .extern C2RXF29          /* 0xBF881310 */
  .extern C2RXF29CLR       /* 0xBF881314 */
  .extern C2RXF29SET       /* 0xBF881318 */
  .extern C2RXF29INV       /* 0xBF88131C */
  .extern C2RXF30          /* 0xBF881320 */
  .extern C2RXF30CLR       /* 0xBF881324 */
  .extern C2RXF30SET       /* 0xBF881328 */
  .extern C2RXF30INV       /* 0xBF88132C */
  .extern C2RXF31          /* 0xBF881330 */
  .extern C2RXF31CLR       /* 0xBF881334 */
  .extern C2RXF31SET       /* 0xBF881338 */
  .extern C2RXF31INV       /* 0xBF88133C */
  .extern C2FIFOBA         /* 0xBF881340 */
  .extern C2FIFOBACLR      /* 0xBF881344 */
  .extern C2FIFOBASET      /* 0xBF881348 */
  .extern C2FIFOBAINV      /* 0xBF88134C */
  .extern C2FIFOCON0       /* 0xBF881350 */
  .extern C2FIFOCON0CLR    /* 0xBF881354 */
  .extern C2FIFOCON0SET    /* 0xBF881358 */
  .extern C2FIFOCON0INV    /* 0xBF88135C */
  .extern C2FIFOINT0       /* 0xBF881360 */
  .extern C2FIFOINT0CLR    /* 0xBF881364 */
  .extern C2FIFOINT0SET    /* 0xBF881368 */
  .extern C2FIFOINT0INV    /* 0xBF88136C */
  .extern C2FIFOUA0        /* 0xBF881370 */
  .extern C2FIFOUA0CLR     /* 0xBF881374 */
  .extern C2FIFOUA0SET     /* 0xBF881378 */
  .extern C2FIFOUA0INV     /* 0xBF88137C */
  .extern C2FIFOCI0        /* 0xBF881380 */
  .extern C2FIFOCI0CLR     /* 0xBF881384 */
  .extern C2FIFOCI0SET     /* 0xBF881388 */
  .extern C2FIFOCI0INV     /* 0xBF88138C */
  .extern C2FIFOCON1       /* 0xBF881390 */
  .extern C2FIFOCON1CLR    /* 0xBF881394 */
  .extern C2FIFOCON1SET    /* 0xBF881398 */
  .extern C2FIFOCON1INV    /* 0xBF88139C */
  .extern C2FIFOINT1       /* 0xBF8813A0 */
  .extern C2FIFOINT1CLR    /* 0xBF8813A4 */
  .extern C2FIFOINT1SET    /* 0xBF8813A8 */
  .extern C2FIFOINT1INV    /* 0xBF8813AC */
  .extern C2FIFOUA1        /* 0xBF8813B0 */
  .extern C2FIFOUA1CLR     /* 0xBF8813B4 */
  .extern C2FIFOUA1SET     /* 0xBF8813B8 */
  .extern C2FIFOUA1INV     /* 0xBF8813BC */
  .extern C2FIFOCI1        /* 0xBF8813C0 */
  .extern C2FIFOCI1CLR     /* 0xBF8813C4 */
  .extern C2FIFOCI1SET     /* 0xBF8813C8 */
  .extern C2FIFOCI1INV     /* 0xBF8813CC */
  .extern C2FIFOCON2       /* 0xBF8813D0 */
  .extern C2FIFOCON2CLR    /* 0xBF8813D4 */
  .extern C2FIFOCON2SET    /* 0xBF8813D8 */
  .extern C2FIFOCON2INV    /* 0xBF8813DC */
  .extern C2FIFOINT2       /* 0xBF8813E0 */
  .extern C2FIFOINT2CLR    /* 0xBF8813E4 */
  .extern C2FIFOINT2SET    /* 0xBF8813E8 */
  .extern C2FIFOINT2INV    /* 0xBF8813EC */
  .extern C2FIFOUA2        /* 0xBF8813F0 */
  .extern C2FIFOUA2CLR     /* 0xBF8813F4 */
  .extern C2FIFOUA2SET     /* 0xBF8813F8 */
  .extern C2FIFOUA2INV     /* 0xBF8813FC */
  .extern C2FIFOCI2        /* 0xBF881400 */
  .extern C2FIFOCI2CLR     /* 0xBF881404 */
  .extern C2FIFOCI2SET     /* 0xBF881408 */
  .extern C2FIFOCI2INV     /* 0xBF88140C */
  .extern C2FIFOCON3       /* 0xBF881410 */
  .extern C2FIFOCON3CLR    /* 0xBF881414 */
  .extern C2FIFOCON3SET    /* 0xBF881418 */
  .extern C2FIFOCON3INV    /* 0xBF88141C */
  .extern C2FIFOINT3       /* 0xBF881420 */
  .extern C2FIFOINT3CLR    /* 0xBF881424 */
  .extern C2FIFOINT3SET    /* 0xBF881428 */
  .extern C2FIFOINT3INV    /* 0xBF88142C */
  .extern C2FIFOUA3        /* 0xBF881430 */
  .extern C2FIFOUA3CLR     /* 0xBF881434 */
  .extern C2FIFOUA3SET     /* 0xBF881438 */
  .extern C2FIFOUA3INV     /* 0xBF88143C */
  .extern C2FIFOCI3        /* 0xBF881440 */
  .extern C2FIFOCI3CLR     /* 0xBF881444 */
  .extern C2FIFOCI3SET     /* 0xBF881448 */
  .extern C2FIFOCI3INV     /* 0xBF88144C */
  .extern C2FIFOCON4       /* 0xBF881450 */
  .extern C2FIFOCON4CLR    /* 0xBF881454 */
  .extern C2FIFOCON4SET    /* 0xBF881458 */
  .extern C2FIFOCON4INV    /* 0xBF88145C */
  .extern C2FIFOINT4       /* 0xBF881460 */
  .extern C2FIFOINT4CLR    /* 0xBF881464 */
  .extern C2FIFOINT4SET    /* 0xBF881468 */
  .extern C2FIFOINT4INV    /* 0xBF88146C */
  .extern C2FIFOUA4        /* 0xBF881470 */
  .extern C2FIFOUA4CLR     /* 0xBF881474 */
  .extern C2FIFOUA4SET     /* 0xBF881478 */
  .extern C2FIFOUA4INV     /* 0xBF88147C */
  .extern C2FIFOCI4        /* 0xBF881480 */
  .extern C2FIFOCI4CLR     /* 0xBF881484 */
  .extern C2FIFOCI4SET     /* 0xBF881488 */
  .extern C2FIFOCI4INV     /* 0xBF88148C */
  .extern C2FIFOCON5       /* 0xBF881490 */
  .extern C2FIFOCON5CLR    /* 0xBF881494 */
  .extern C2FIFOCON5SET    /* 0xBF881498 */
  .extern C2FIFOCON5INV    /* 0xBF88149C */
  .extern C2FIFOINT5       /* 0xBF8814A0 */
  .extern C2FIFOINT5CLR    /* 0xBF8814A4 */
  .extern C2FIFOINT5SET    /* 0xBF8814A8 */
  .extern C2FIFOINT5INV    /* 0xBF8814AC */
  .extern C2FIFOUA5        /* 0xBF8814B0 */
  .extern C2FIFOUA5CLR     /* 0xBF8814B4 */
  .extern C2FIFOUA5SET     /* 0xBF8814B8 */
  .extern C2FIFOUA5INV     /* 0xBF8814BC */
  .extern C2FIFOCI5        /* 0xBF8814C0 */
  .extern C2FIFOCI5CLR     /* 0xBF8814C4 */
  .extern C2FIFOCI5SET     /* 0xBF8814C8 */
  .extern C2FIFOCI5INV     /* 0xBF8814CC */
  .extern C2FIFOCON6       /* 0xBF8814D0 */
  .extern C2FIFOCON6CLR    /* 0xBF8814D4 */
  .extern C2FIFOCON6SET    /* 0xBF8814D8 */
  .extern C2FIFOCON6INV    /* 0xBF8814DC */
  .extern C2FIFOINT6       /* 0xBF8814E0 */
  .extern C2FIFOINT6CLR    /* 0xBF8814E4 */
  .extern C2FIFOINT6SET    /* 0xBF8814E8 */
  .extern C2FIFOINT6INV    /* 0xBF8814EC */
  .extern C2FIFOUA6        /* 0xBF8814F0 */
  .extern C2FIFOUA6CLR     /* 0xBF8814F4 */
  .extern C2FIFOUA6SET     /* 0xBF8814F8 */
  .extern C2FIFOUA6INV     /* 0xBF8814FC */
  .extern C2FIFOCI6        /* 0xBF881500 */
  .extern C2FIFOCI6CLR     /* 0xBF881504 */
  .extern C2FIFOCI6SET     /* 0xBF881508 */
  .extern C2FIFOCI6INV     /* 0xBF88150C */
  .extern C2FIFOCON7       /* 0xBF881510 */
  .extern C2FIFOCON7CLR    /* 0xBF881514 */
  .extern C2FIFOCON7SET    /* 0xBF881518 */
  .extern C2FIFOCON7INV    /* 0xBF88151C */
  .extern C2FIFOINT7       /* 0xBF881520 */
  .extern C2FIFOINT7CLR    /* 0xBF881524 */
  .extern C2FIFOINT7SET    /* 0xBF881528 */
  .extern C2FIFOINT7INV    /* 0xBF88152C */
  .extern C2FIFOUA7        /* 0xBF881530 */
  .extern C2FIFOUA7CLR     /* 0xBF881534 */
  .extern C2FIFOUA7SET     /* 0xBF881538 */
  .extern C2FIFOUA7INV     /* 0xBF88153C */
  .extern C2FIFOCI7        /* 0xBF881540 */
  .extern C2FIFOCI7CLR     /* 0xBF881544 */
  .extern C2FIFOCI7SET     /* 0xBF881548 */
  .extern C2FIFOCI7INV     /* 0xBF88154C */
  .extern C2FIFOCON8       /* 0xBF881550 */
  .extern C2FIFOCON8CLR    /* 0xBF881554 */
  .extern C2FIFOCON8SET    /* 0xBF881558 */
  .extern C2FIFOCON8INV    /* 0xBF88155C */
  .extern C2FIFOINT8       /* 0xBF881560 */
  .extern C2FIFOINT8CLR    /* 0xBF881564 */
  .extern C2FIFOINT8SET    /* 0xBF881568 */
  .extern C2FIFOINT8INV    /* 0xBF88156C */
  .extern C2FIFOUA8        /* 0xBF881570 */
  .extern C2FIFOUA8CLR     /* 0xBF881574 */
  .extern C2FIFOUA8SET     /* 0xBF881578 */
  .extern C2FIFOUA8INV     /* 0xBF88157C */
  .extern C2FIFOCI8        /* 0xBF881580 */
  .extern C2FIFOCI8CLR     /* 0xBF881584 */
  .extern C2FIFOCI8SET     /* 0xBF881588 */
  .extern C2FIFOCI8INV     /* 0xBF88158C */
  .extern C2FIFOCON9       /* 0xBF881590 */
  .extern C2FIFOCON9CLR    /* 0xBF881594 */
  .extern C2FIFOCON9SET    /* 0xBF881598 */
  .extern C2FIFOCON9INV    /* 0xBF88159C */
  .extern C2FIFOINT9       /* 0xBF8815A0 */
  .extern C2FIFOINT9CLR    /* 0xBF8815A4 */
  .extern C2FIFOINT9SET    /* 0xBF8815A8 */
  .extern C2FIFOINT9INV    /* 0xBF8815AC */
  .extern C2FIFOUA9        /* 0xBF8815B0 */
  .extern C2FIFOUA9CLR     /* 0xBF8815B4 */
  .extern C2FIFOUA9SET     /* 0xBF8815B8 */
  .extern C2FIFOUA9INV     /* 0xBF8815BC */
  .extern C2FIFOCI9        /* 0xBF8815C0 */
  .extern C2FIFOCI9CLR     /* 0xBF8815C4 */
  .extern C2FIFOCI9SET     /* 0xBF8815C8 */
  .extern C2FIFOCI9INV     /* 0xBF8815CC */
  .extern C2FIFOCON10      /* 0xBF8815D0 */
  .extern C2FIFOCON10CLR   /* 0xBF8815D4 */
  .extern C2FIFOCON10SET   /* 0xBF8815D8 */
  .extern C2FIFOCON10INV   /* 0xBF8815DC */
  .extern C2FIFOINT10      /* 0xBF8815E0 */
  .extern C2FIFOINT10CLR   /* 0xBF8815E4 */
  .extern C2FIFOINT10SET   /* 0xBF8815E8 */
  .extern C2FIFOINT10INV   /* 0xBF8815EC */
  .extern C2FIFOUA10       /* 0xBF8815F0 */
  .extern C2FIFOUA10CLR    /* 0xBF8815F4 */
  .extern C2FIFOUA10SET    /* 0xBF8815F8 */
  .extern C2FIFOUA10INV    /* 0xBF8815FC */
  .extern C2FIFOCI10       /* 0xBF881600 */
  .extern C2FIFOCI10CLR    /* 0xBF881604 */
  .extern C2FIFOCI10SET    /* 0xBF881608 */
  .extern C2FIFOCI10INV    /* 0xBF88160C */
  .extern C2FIFOCON11      /* 0xBF881610 */
  .extern C2FIFOCON11CLR   /* 0xBF881614 */
  .extern C2FIFOCON11SET   /* 0xBF881618 */
  .extern C2FIFOCON11INV   /* 0xBF88161C */
  .extern C2FIFOINT11      /* 0xBF881620 */
  .extern C2FIFOINT11CLR   /* 0xBF881624 */
  .extern C2FIFOINT11SET   /* 0xBF881628 */
  .extern C2FIFOINT11INV   /* 0xBF88162C */
  .extern C2FIFOUA11       /* 0xBF881630 */
  .extern C2FIFOUA11CLR    /* 0xBF881634 */
  .extern C2FIFOUA11SET    /* 0xBF881638 */
  .extern C2FIFOUA11INV    /* 0xBF88163C */
  .extern C2FIFOCI11       /* 0xBF881640 */
  .extern C2FIFOCI11CLR    /* 0xBF881644 */
  .extern C2FIFOCI11SET    /* 0xBF881648 */
  .extern C2FIFOCI11INV    /* 0xBF88164C */
  .extern C2FIFOCON12      /* 0xBF881650 */
  .extern C2FIFOCON12CLR   /* 0xBF881654 */
  .extern C2FIFOCON12SET   /* 0xBF881658 */
  .extern C2FIFOCON12INV   /* 0xBF88165C */
  .extern C2FIFOINT12      /* 0xBF881660 */
  .extern C2FIFOINT12CLR   /* 0xBF881664 */
  .extern C2FIFOINT12SET   /* 0xBF881668 */
  .extern C2FIFOINT12INV   /* 0xBF88166C */
  .extern C2FIFOUA12       /* 0xBF881670 */
  .extern C2FIFOUA12CLR    /* 0xBF881674 */
  .extern C2FIFOUA12SET    /* 0xBF881678 */
  .extern C2FIFOUA12INV    /* 0xBF88167C */
  .extern C2FIFOCI12       /* 0xBF881680 */
  .extern C2FIFOCI12CLR    /* 0xBF881684 */
  .extern C2FIFOCI12SET    /* 0xBF881688 */
  .extern C2FIFOCI12INV    /* 0xBF88168C */
  .extern C2FIFOCON13      /* 0xBF881690 */
  .extern C2FIFOCON13CLR   /* 0xBF881694 */
  .extern C2FIFOCON13SET   /* 0xBF881698 */
  .extern C2FIFOCON13INV   /* 0xBF88169C */
  .extern C2FIFOINT13      /* 0xBF8816A0 */
  .extern C2FIFOINT13CLR   /* 0xBF8816A4 */
  .extern C2FIFOINT13SET   /* 0xBF8816A8 */
  .extern C2FIFOINT13INV   /* 0xBF8816AC */
  .extern C2FIFOUA13       /* 0xBF8816B0 */
  .extern C2FIFOUA13CLR    /* 0xBF8816B4 */
  .extern C2FIFOUA13SET    /* 0xBF8816B8 */
  .extern C2FIFOUA13INV    /* 0xBF8816BC */
  .extern C2FIFOCI13       /* 0xBF8816C0 */
  .extern C2FIFOCI13CLR    /* 0xBF8816C4 */
  .extern C2FIFOCI13SET    /* 0xBF8816C8 */
  .extern C2FIFOCI13INV    /* 0xBF8816CC */
  .extern C2FIFOCON14      /* 0xBF8816D0 */
  .extern C2FIFOCON14CLR   /* 0xBF8816D4 */
  .extern C2FIFOCON14SET   /* 0xBF8816D8 */
  .extern C2FIFOCON14INV   /* 0xBF8816DC */
  .extern C2FIFOINT14      /* 0xBF8816E0 */
  .extern C2FIFOINT14CLR   /* 0xBF8816E4 */
  .extern C2FIFOINT14SET   /* 0xBF8816E8 */
  .extern C2FIFOINT14INV   /* 0xBF8816EC */
  .extern C2FIFOUA14       /* 0xBF8816F0 */
  .extern C2FIFOUA14CLR    /* 0xBF8816F4 */
  .extern C2FIFOUA14SET    /* 0xBF8816F8 */
  .extern C2FIFOUA14INV    /* 0xBF8816FC */
  .extern C2FIFOCI14       /* 0xBF881700 */
  .extern C2FIFOCI14CLR    /* 0xBF881704 */
  .extern C2FIFOCI14SET    /* 0xBF881708 */
  .extern C2FIFOCI14INV    /* 0xBF88170C */
  .extern C2FIFOCON15      /* 0xBF881710 */
  .extern C2FIFOCON15CLR   /* 0xBF881714 */
  .extern C2FIFOCON15SET   /* 0xBF881718 */
  .extern C2FIFOCON15INV   /* 0xBF88171C */
  .extern C2FIFOINT15      /* 0xBF881720 */
  .extern C2FIFOINT15CLR   /* 0xBF881724 */
  .extern C2FIFOINT15SET   /* 0xBF881728 */
  .extern C2FIFOINT15INV   /* 0xBF88172C */
  .extern C2FIFOUA15       /* 0xBF881730 */
  .extern C2FIFOUA15CLR    /* 0xBF881734 */
  .extern C2FIFOUA15SET    /* 0xBF881738 */
  .extern C2FIFOUA15INV    /* 0xBF88173C */
  .extern C2FIFOCI15       /* 0xBF881740 */
  .extern C2FIFOCI15CLR    /* 0xBF881744 */
  .extern C2FIFOCI15SET    /* 0xBF881748 */
  .extern C2FIFOCI15INV    /* 0xBF88174C */
  .extern C2FIFOCON16      /* 0xBF881750 */
  .extern C2FIFOCON16CLR   /* 0xBF881754 */
  .extern C2FIFOCON16SET   /* 0xBF881758 */
  .extern C2FIFOCON16INV   /* 0xBF88175C */
  .extern C2FIFOINT16      /* 0xBF881760 */
  .extern C2FIFOINT16CLR   /* 0xBF881764 */
  .extern C2FIFOINT16SET   /* 0xBF881768 */
  .extern C2FIFOINT16INV   /* 0xBF88176C */
  .extern C2FIFOUA16       /* 0xBF881770 */
  .extern C2FIFOUA16CLR    /* 0xBF881774 */
  .extern C2FIFOUA16SET    /* 0xBF881778 */
  .extern C2FIFOUA16INV    /* 0xBF88177C */
  .extern C2FIFOCI16       /* 0xBF881780 */
  .extern C2FIFOCI16CLR    /* 0xBF881784 */
  .extern C2FIFOCI16SET    /* 0xBF881788 */
  .extern C2FIFOCI16INV    /* 0xBF88178C */
  .extern C2FIFOCON17      /* 0xBF881790 */
  .extern C2FIFOCON17CLR   /* 0xBF881794 */
  .extern C2FIFOCON17SET   /* 0xBF881798 */
  .extern C2FIFOCON17INV   /* 0xBF88179C */
  .extern C2FIFOINT17      /* 0xBF8817A0 */
  .extern C2FIFOINT17CLR   /* 0xBF8817A4 */
  .extern C2FIFOINT17SET   /* 0xBF8817A8 */
  .extern C2FIFOINT17INV   /* 0xBF8817AC */
  .extern C2FIFOUA17       /* 0xBF8817B0 */
  .extern C2FIFOUA17CLR    /* 0xBF8817B4 */
  .extern C2FIFOUA17SET    /* 0xBF8817B8 */
  .extern C2FIFOUA17INV    /* 0xBF8817BC */
  .extern C2FIFOCI17       /* 0xBF8817C0 */
  .extern C2FIFOCI17CLR    /* 0xBF8817C4 */
  .extern C2FIFOCI17SET    /* 0xBF8817C8 */
  .extern C2FIFOCI17INV    /* 0xBF8817CC */
  .extern C2FIFOCON18      /* 0xBF8817D0 */
  .extern C2FIFOCON18CLR   /* 0xBF8817D4 */
  .extern C2FIFOCON18SET   /* 0xBF8817D8 */
  .extern C2FIFOCON18INV   /* 0xBF8817DC */
  .extern C2FIFOINT18      /* 0xBF8817E0 */
  .extern C2FIFOINT18CLR   /* 0xBF8817E4 */
  .extern C2FIFOINT18SET   /* 0xBF8817E8 */
  .extern C2FIFOINT18INV   /* 0xBF8817EC */
  .extern C2FIFOUA18       /* 0xBF8817F0 */
  .extern C2FIFOUA18CLR    /* 0xBF8817F4 */
  .extern C2FIFOUA18SET    /* 0xBF8817F8 */
  .extern C2FIFOUA18INV    /* 0xBF8817FC */
  .extern C2FIFOCI18       /* 0xBF881800 */
  .extern C2FIFOCI18CLR    /* 0xBF881804 */
  .extern C2FIFOCI18SET    /* 0xBF881808 */
  .extern C2FIFOCI18INV    /* 0xBF88180C */
  .extern C2FIFOCON19      /* 0xBF881810 */
  .extern C2FIFOCON19CLR   /* 0xBF881814 */
  .extern C2FIFOCON19SET   /* 0xBF881818 */
  .extern C2FIFOCON19INV   /* 0xBF88181C */
  .extern C2FIFOINT19      /* 0xBF881820 */
  .extern C2FIFOINT19CLR   /* 0xBF881824 */
  .extern C2FIFOINT19SET   /* 0xBF881828 */
  .extern C2FIFOINT19INV   /* 0xBF88182C */
  .extern C2FIFOUA19       /* 0xBF881830 */
  .extern C2FIFOUA19CLR    /* 0xBF881834 */
  .extern C2FIFOUA19SET    /* 0xBF881838 */
  .extern C2FIFOUA19INV    /* 0xBF88183C */
  .extern C2FIFOCI19       /* 0xBF881840 */
  .extern C2FIFOCI19CLR    /* 0xBF881844 */
  .extern C2FIFOCI19SET    /* 0xBF881848 */
  .extern C2FIFOCI19INV    /* 0xBF88184C */
  .extern C2FIFOCON20      /* 0xBF881850 */
  .extern C2FIFOCON20CLR   /* 0xBF881854 */
  .extern C2FIFOCON20SET   /* 0xBF881858 */
  .extern C2FIFOCON20INV   /* 0xBF88185C */
